Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Server Name Indication (SNI) is a TLS extension that makes it possible for a client to specify the host name to which it attempts to connect during the TLS handshake. SNI enables a server to present different TLS certificates for multiple domains on a single IP address, which facilitates secure communication for virtual hosting scenarios.
ja_jp: Server Name Indication (SNI) は、TLS ハンドシェイク中にクライアントが接続を試みるホスト名を指定できるようにする TLS エクステンションです。 SNI を使用すると、サーバーが単一の IP アドレス上の複数のドメインに対して異なる TLS 証明書を提示できるようになります。これにより、仮想ホスティングシナリオでセキュアな通信が容易になります。

source: Server Name Indication (SNI) is a TLS extension that makes it possible for a client to specify the hostname to which it attempts to connect during the TLS handshake. SNI enables a server to present multiple TLS certificates for different domains on a single IP address, facilitating secure communication in virtual hosting scenarios.
ja_jp: Server Name Indication (SNI) は、TLS ハンドシェイク中にクライアントが接続しようとするホスト名を指定できるようにする TLS エクステンションです。SNI により、サーバーは単一の IP アドレスで異なるドメインに対して複数の TLS 証明書を提示でき、仮想ホスティングシナリオでのセキュアな通信が容易になります。

source: Server agents can now:
ja_jp: サーバーエージェントで以下のことが可能になりました。

source: Server and client endpoints will always respond to a ping message sent from the remote party with a corresponding pong message, using the application data from the ping message. This behavior is built-in and requires no additional code or configuration.
ja_jp: サーバーおよびクライアントのエンドポイントは、ping メッセージのアプリケーションデータを使用して、リモート側から送信された ping メッセージに対し、常に対応する pong メッセージでレスポンスします。 この動作は組み込まれており、追加のコードや設定は必要ありません。

source: Server configuration
ja_jp: サーバーの設定

source: Server configuration example
ja_jp: サーバー設定例

source: Server endpoints
ja_jp: サーバーエンドポイント

source: Server endpoints are classes annotated with `@io.quarkus.websockets.next.WebSocket`. The value of `WebSocket#path()` is used to define the path of the endpoint.
ja_jp: サーバーエンドポイントは、 `@io.quarkus.websockets.next.WebSocket` アノテーションが付けられたクラスです。 `WebSocket#path()` の値は、エンドポイントのパスを定義するために使用されます。

source: Server-Sent Event (SSE) support
ja_jp: サーバー送信イベント (SSE) のサポート

source: Servers and clients can send ping messages programmatically at any time using `WebSocketConnection` or `WebSocketClientConnection`. There is a non-blocking variant: `Sender#sendPing(Buffer)` and a blocking variant: `Sender#sendPingAndAwait(Buffer)`.
ja_jp: サーバーとクライアントは、 `WebSocketConnection` または `WebSocketClientConnection` を使用して、いつでもプログラムで ping メッセージを送信できます。 ノンブロッキングバリアント (`Sender#sendPing(Buffer)`) とブロッキングバリアント (`Sender#sendPingAndAwait(Buffer)`) があります。

source: Servers and clients can send unsolicited pong messages that may serve as a unidirectional heartbeat using `WebSocketConnection` or `WebSocketClientConnection`. There is a non-blocking variant: `Sender#sendPong(Buffer)` and a blocking variant: `Sender#sendPongAndAwait(Buffer)`.
ja_jp: サーバーとクライアントは、 `WebSocketConnection` または `WebSocketClientConnection` を使用して、一方向のハートビートとして機能する可能性のある非要求 pong メッセージを送信できます。ノンブロッキングバリアント (`Sender#sendPong(Buffer)`) とブロッキングバリアント (`Sender#sendPongAndAwait(Buffer)`) があります。

source: Service
ja_jp: サービス

source: Service Binding
ja_jp: サービスバインディング

source: Service Binding support has been deprecated
ja_jp: サービスバインディングのサポートは非推奨になりました。

source: Service Discovery
ja_jp: サービスディスカバリー

source: Service Interface
ja_jp: サービスインターフェース

source: Service Loading
ja_jp: サービスローディング

source: Service Readiness
ja_jp: サービスの準備完了

source: Service bindings got a new component supported: MongoDB.
ja_jp: サービスバインディングに新しいコンポーネントが追加されました。MongoDBです。

source: Service configuration information.
ja_jp: サービス構成情報

source: Service discovery and load balancing with Stork
ja_jp: Storkでサービスディスカバリーとロードバランシング

source: Service discovery cache refresh period
ja_jp: サービスディスカバリーキャッシュの更新期間

source: Service discovery is the process of locating service instances. It produces a list of service instances that is potentially empty (if no service matches the request) or contains multiple service instances.
ja_jp: サービスディスカバリーとは、サービスインスタンスを探すプロセスのことです。サービス・ディスカバリーでは、サービス・インスタンスのリストが作成されます。このリストは、（リクエストにマッチするサービスがない場合）空の可能性もあれば、複数のサービス・インスタンスを含む可能性もあります。

source: Service discovery solves that problem, as it provides a mechanism to register and find the services. But it leads to another issue. What happens when there are multiple instances of the same service? How does a microservice select the right one? This scenario typically occurs when there are multiple replicas or versions available at the same time. Thus, in addition to service discovery, we need a way to select the right one.
ja_jp: サービスディスカバリーは、サービスを登録して検索する仕組みを提供することで、その問題を解決します。しかし、それは別の問題を引き起こします。同じサービスのインスタンスが複数ある場合はどうなるのか？マイクロサービスはどのようにして正しいサービスを選択するのでしょうか？このシナリオは通常、複数のレプリカやバージョンが同時に利用可能な場合に発生します。そのため、サービスディスカバリーに加えて、正しいサービスを選択する方法が必要になります。

source: Service files
ja_jp: サービスファイル

source: Service lifecycle events or important related very low-frequency information.
ja_jp: サービスライフサイクルのイベントや、関連する重要な超低頻度情報。

source: Service lifecycle events or important related very-low-frequency information.
ja_jp: サービスのライフサイクルイベントまたは重要な関連する非常に低頻度の情報

source: Service lifecycle events or other important infrequent information.
ja_jp: サービスライフサイクルイベントまたはその他の重要で頻度の低い情報。

source: Service method validation
ja_jp: サービスメソッドの検証

source: Service registration in Consul
ja_jp: Consulでのサービス登録

source: Service selection can be pretty advanced. For instance, the least-response-time strategy monitors the service calls to select the _fastest_ service instance.
ja_jp: サービス選択はかなり高度なものになります。例えば、最小応答時間戦略では、サービスコールを監視し、 _最速の_ サービスインスタンスを選択します。

source: Service selection, also called load-balancing, chooses the best instance from the list returned by the discovery process. The result is a single service instance or an exception when no suitable instance can be found.
ja_jp: サービスセレクションはロードバランスとも呼ばれ、ディスカバリープロセスから返されたリストの中から最適なインスタンスを選択します。その結果、1つのサービスインスタンスになるか、適切なインスタンスが見つからない場合は例外となります。

source: Services start an LRA (or join an existing one) by marking a JAX-RS method with an https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/org/eclipse/microprofile/lra/annotation/ws/rs/LRA.html[@LRA annotation]. When such a method is invoked the system will start the action and make its identifier available as a JAX-RS header called "Long-Running-Action". If the body of the method performs any JAX-RS invocations the header is automatically added to outgoing requests. In this way the target services can join in with the interaction (if they are also annotated with the `@LRA` annotation).
ja_jp: サービスは、JAX-RSメソッドを https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/org/eclipse/microprofile/lra/annotation/ws/rs/LRA.html[@LRA annotation] でマークすることで、LRAを開始（または既存のものに参加）します。このようなメソッドが呼び出されると、システムはアクションを開始し、その識別子を "Long-Running-Action" というJAX-RSヘッダーとして利用可能にします。メソッドのボディが何らかのJAX-RSの呼び出しを実行すると、このヘッダーは自動的に送信リクエストに追加されます。このようにして、対象となるサービスは、（ `@LRA` ）アノテーションが付与されていれば、対話に参加することができます。

source: Services started by Compose Dev Services are automatically discovered by extensions providing dev services. Each extension discovers the services it needs and configures the application accordingly.
ja_jp: Compose Dev Services によって開始されたサービスは、dev services を提供するエクステンションによって自動的に検出されます。各エクステンションは必要なサービスを検出し、それに応じてアプリケーションを構成します。

source: Serving Hello World with Qute
ja_jp: Qute を使用した Hello World の提供

source: Serving Qute templates via HTTP
ja_jp: HTTP 経由での Qute テンプレートの提供

source: Serving Static Resources
ja_jp: 静的リソースの提供

source: Serving a few static pages and scripts from an existing Quarkus backend is not a big overhead, so scaling the full app is usually the simplest option. You could also split it in two services: one for the backend and one for the frontend. However, in most cases, this approach wouldn’t yield substantial benefits compared to the initial method.
ja_jp: 既存の Quarkus バックエンドからいくつかの静的ページとスクリプトを提供してもオーバーヘッドは大きくないため、通常は完全なアプリケーションをスケーリングするのが最も簡単なオプションです。 バックエンド用とフロントエンド用の 2 つのサービスに分割することもできます。ただし、ほとんどの場合、このアプローチでは最初の方法に比べて大きなメリットは得られません。

source: Serving scripts, styles, and web libraries
ja_jp: スクリプト、スタイル、Web ライブラリーの提供

source: Serving static resources
ja_jp: 静的リソースの提供

source: Serving static resources from a local filesystem directory is enabled when `quarkus.http.static-dir.path` is set. The `quarkus.http.static-dir.enabled` property can be used to explicitly disable this feature.
ja_jp: `quarkus.http.static-dir.path` が設定されている場合、ローカルファイルシステムのディレクトリーからの静的リソースの提供が有効になります。 `quarkus.http.static-dir.enabled` プロパティーを使用して、この機能を明示的に無効にすることもできます。

source: Servlet Config
ja_jp: サーブレットの設定

source: Servlet compatibility
ja_jp: サーブレットとの互換性

source: Servlets
ja_jp: サーブレット

source: Session Abstracts
ja_jp: セッション概要

source: Session Management
ja_jp: セッション管理

source: Session age extension
ja_jp: セッション有効期間の延長

source: Session context
ja_jp: セッションコンテキスト

source: Session cookie and custom TokenStateManager
ja_jp: セッションクッキーとカスタムTokenStateManager

source: Session cookie and default TokenStateManager
ja_jp: セッションクッキーとデフォルトの TokenStateManager

source: Session cookie and refresh
ja_jp: セッション Cookie とリフレッシュ

source: Session cookie is created after an authorizaion code flow is completed. An expired session cookie can be refreshed.
ja_jp: セッション Cookie は、認可コードフローの完了後に作成されます。期限切れのセッション Cookie はリフレッシュ可能です。

source: Session expired path
ja_jp: セッション期限切れパス

source: Session management
ja_jp: セッション管理

source: Session management in Vertx OIDC and Quarkus OIDC
ja_jp: Vertx OIDC と Quarkus OIDC におけるセッション管理

source: Session properties
ja_jp: セッションプロパティー

source: Session type
ja_jp: セッション型

source: Session-level: `session.connected-nodes` and `session.bytes-sent`;
ja_jp: セッションレベル: `session.connected-nodes` および `session.bytes-sent`;

source: Sessions and Transactions
ja_jp: セッションとトランザクション

source: Set `MDC.put(...)` as shown in the example below:
ja_jp: 以下の例に示すように、 `MDC.put(…​)` を設定します。

source: Set TLS using KeyStore way.
ja_jp: KeyStoreの方法でTLSを設定します。

source: Set `Service entity descriptor` to point to the Okta SAML Integration Metadata URL you noted at the end of the previous step.
ja_jp: 前の手順の最後に書き留めた Okta SAML Integration Metadata URL を指すように `Service entity descriptor` を設定します。

source: Set `application.properties`, for example:
ja_jp: `application.properties` を次のように設定します。

source: Set `quarkus.datasource[.optional name].active` to `false`.
ja_jp: `quarkus.datasource[.optional name].active` を `false` に設定します。

source: Set `quarkus.http.access-log.consolidate-rerouted-requests=true` to enable support for the modifier `<`. This modifier can be used for requests that have been internally redirected to consult the original request. The following attributes support this modifier:
ja_jp: 修飾子 `<` のサポートを有効にするには `quarkus.http.access-log.consolidate-rerouted-requests=true` を設定します。この修飾子は、元のリクエストを参照するために内部的にリダイレクトされた リクエストに使用できます。 以下の属性がこの修飾子をサポートしています：

source: Set `quarkus.http.record-request-start-time=true` to enable recording request start times when using any of the attributes related to logging request processing times.
ja_jp: リクエストの処理にかかった時間のロギングに関連する属性のいずれかを使用する場合は、 `quarkus.http.record-request-start-time=true` を設定し、リクエスト開始時間の記録を有効にして下さい。

source: Set `quarkus.mongodb[.optional name].active` to `false`.
ja_jp: `quarkus.mongodb[.optional name].active` を `false` に設定する。

source: Set `quarkus.native.builder-image` property to `quay.io/quarkus/ubi-quarkus-graalvmce-builder-image:{graalvm-flavor}`
ja_jp: `quarkus.native.build-image` プロパティーに `quay.io/quarkus/ubi-quarkus-native-image:{graalvm-flavor}` をセット

source: Set `quarkus.native.builder-image` property to `quay.io/quarkus/ubi-quarkus-mandrel-builder-image:{mandrel-flavor}`
ja_jp: `quarkus.native.builder-image` プロパティに `quay.io/quarkus/ubi-quarkus-mandrel-builder-image:{mandrel-flavor}` をセット

source: Set `quarkus.native.builder-image` property to `quay.io/quarkus/ubi-quarkus-native-image:{graalvm-flavor}`
ja_jp: `quarkus.native.build-image` プロパティーを `quay.io/quarkus/ubi-quarkus-native-image:{graalvm-flavor}`

source: Set `quarkus.native.builder-image` property to `quay.io/quarkus/ubi9-quarkus-mandrel-builder-image:{mandrel-flavor}`
ja_jp: `quarkus.native.builder-image` プロパティに `quay.io/quarkus/ubi9-quarkus-mandrel-builder-image:{mandrel-flavor}` をセット

source: Set `quarkus.native.container-build` property to `true`
ja_jp: `quarkus.native.container-build` プロパティーに `true` をセット

source: Set `quarkus.oidc.authentication.session-age-extension` to be _reasonably_ long for your barely-active users and in accordance with your security policies.
ja_jp: ほとんどアクティブでないユーザーに対しては、セキュリティーポリシーに合わせて、 `quarkus.oidc.authentication.session-age-extension` を _適度に_ 長い値に設定します。

source: Set `quarkus.oidc.authentication.user-info-required=true` if a UserInfo JSON object from the OIDC userinfo endpoint has to be requested. A request will be sent to the OpenID Provider UserInfo endpoint and an `io.quarkus.oidc.UserInfo` (a simple `javax.json.JsonObject` wrapper) object will be created. `io.quarkus.oidc.UserInfo` can be either injected or accessed as a SecurityIdentity `userinfo` attribute.
ja_jp: OIDC userinfo エンドポイントから UserInfo JSON オブジェクトを要求する必要がある場合は `quarkus.oidc.authentication.user-info-required=true` を設定します。リクエストが OpenId Provider UserInfo エンドポイントに送信され、 `io.quarkus.oidc.UserInfo` (単純な `javax.json.JsonObject` ラッパー) オブジェクトが作成されます。 `io.quarkus.oidc.UserInfo` は、SecurityIdentity `userinfo` 属性として注入、アクセスすることもできます。

source: Set `quarkus.oidc.credentials.jwt.source=bearer` if the client authentication token is provided by Kubernetes, and use `quarkus.oidc.credentials.jwt.token-path` to point to the file resource containing this token.
ja_jp: クライアント認証トークンが Kubernetes によって提供される場合は `quarkus.oidc.credentials.jwt.source=bearer` を設定し、`quarkus.oidc.credentials.jwt.token-path` を使用してこのトークンを含むファイルリソースを指すようにします。

source: Set `quarkus.redis[.optional name].active` to `false`.
ja_jp: `quarkus.redis[.optional name].active` を `false` に設定する。

source: Set `{keycloak.version}` to `26.1.3` or later.
ja_jp: `{keycloak.version}` を `26.1.3` 以降に設定してください。

source: Set a human‑readable description.
ja_jp: 人間が読み取り可能な説明を設定します。

source: Set a relative service endpoint path and click *Log in to your web application*. You are redirected to Keycloak to enter a username and password in a new browser tab before you get a response from the Quarkus application.
ja_jp: 相対的なサービスエンドポイントパスを設定し、*Log in to your web application* をクリックします。 Quarkus アプリケーションからのレスポンスを受け取る前に、新しいブラウザータブでユーザー名とパスワードを入力するために Keycloak にリダイレクトされます。

source: Set a relative service endpoint path, click on `Sign In To Service` and you will be redirected to Keycloak to enter a username and password in a new browser tab and get a response from the Quarkus application.
ja_jp: 相対的なサービスエンドポイントパスを設定し、 `Sign In To Service` をクリックすると Keycloak にリダイレクトされます。新しいブラウザータブにユーザー名とパスワードを入力し、Quarkus アプリケーションからレスポンスを取得します。

source: Set at least one category to ensure that the content is findable on the link:https://quarkus.io/guides/[Quarkus documentation home page]. For a list of Quarkus categories, see xref:doc-reference.adoc#document-attributes-and-variables[Document attributes and variables] on the "Quarkus style and content guidelines" page.
ja_jp: link:https://quarkus.io/guides/[Quarkusドキュメントのホームページ] でコンテンツが検索できるように、少なくとも1つのカテゴリーを設定してください。Quarkusのカテゴリのリストについては、「Quarkusスタイル・コンテンツガイドライン」ページの xref:doc-reference.adoc#document-attributes-and-variables[ドキュメントの属性と変数] を参照してください。

source: Set at least one category to ensure that the content is findable on the link:https://quarkus.io/guides/[Quarkus documentation home page]. For a list of Quarkus categories, see xref:{doc-guides}/doc-reference.adoc#document-attributes-and-variables[Document attributes and variables] on the "Quarkus style and content guidelines" page.
ja_jp: link:https://quarkus.io/guides/[Quarkusドキュメントのホームページ] でコンテンツが検索できるように、少なくとも1つのカテゴリーを設定してください。Quarkusのカテゴリのリストについては、「Quarkusスタイル・コンテンツガイドライン」ページの link:{doc-guides}/doc-reference.html#document-attributes-and-variables[ドキュメントの属性と変数] を参照してください。

source: Set durable to false
ja_jp: 耐久性を false に設定

source: Set of Cache-Control header directives
ja_jp: Cache-Control ヘッダーディレクティブのセット

source: Set of TLS Ciphers.
ja_jp: TLS Ciphersのセット。

source: Set of trusted hostnames. If the keys have to be fetched over `HTTPS` and `smallrye.jwt.client.tls.trust-all` is set to `false` then this property can be used to configure the trusted hostnames.
ja_jp: 信頼できるホスト名のセット。キーを `HTTPS` 経由でフェッチする必要があり、 `smallrye.jwt.client.tls.trust-all` が `false` に設定されている場合、このプロパティーを使用して信頼できるホスト名を設定できます。

source: Set the deadline for all injected clients.
ja_jp: インジェクトされたすべてのクライアントのデッドラインを設定します。

source: Set the deadline for all injected stubs.
ja_jp: すべての注入されたスタブのデッドラインを設定します。

source: Set the Docker build strategy in your `application.properties` configuration file:
ja_jp: `application.properties` 設定ファイルで Docker ビルドストラテジーを設定します：

source: Set the Hibernate ORM dialect.
ja_jp: Hibernate ORM dialectを設定します。

source: Set the Maven local repository directory for the tests
ja_jp: テスト用のMavenローカルリポジトリのディレクトリを設定

source: Set the Maven settings file the tests
ja_jp: テスト用の Maven 設定ファイルを設定します

source: Set the RuntimeValue as returned from your recorder.
ja_jp: レコーダーから返される RuntimeValue を設定します。

source: Set the `Remote Storage` URL to `https://registry.quarkus.io/maven`
ja_jp: `Remote Storage` URLを設定します。 `https://registry.quarkus.io/maven`

source: Set the `Repository Policy` to `Snapshot`;
ja_jp: `Repository Policy` を `Snapshot` に設定。

source: Set the `Version Policy` to `Snapshot`
ja_jp: `Version Policy` を `Snapshot` に設定

source: Set the `id` value to be the same as the file name but without the extension.
ja_jp: `id` 値をファイル名と同じ (拡張子なし) に設定します。

source: Set the `id` value to be the same as the file name but without the extension. You can shorten this if the file name is too long.
ja_jp: `id` の値は、ファイル名と同じで、拡張子を除いたものに設定してください。ファイル名が長すぎる場合は、これを短くすることができます。

source: Set the `owasp-dependency-check-plugin.version` value to `7.1.1` or later.
ja_jp: `owasp-dependency-check-plugin.version` には `7.1.1` 以降をセットして下さい。

source: Set the `owasp-dependency-check-plugin.version` value to `8.2.1` or later.
ja_jp: `owasp-dependency-check-plugin.version` の値を `8.2.1` 以降に設定してください。

source: Set the `owasp-dependency-check-plugin.version` value to `8.3.1` or later.
ja_jp: `owasp-dependency-check-plugin.version` の値を `8.3.1` 以降に設定する。

source: Set the `quarkus.http.auth.permission.custom1.applies-to=jaxrs` configuration property.
ja_jp: `quarkus.http.auth.permission.custom1.applies-to=jaxrs` 設定プロパティーを設定します。

source: Set the `quarkus.oidc.authentication.user-info-required=true` property to request a link:https://openid.net/specs/openid-connect-core-1_0.html#UserInfo[UserInfo] JSON object from the OIDC `UserInfo` endpoint.
ja_jp: `quarkus.oidc.authentication.user-info-required=true` プロパティーを設定して、OIDC `UserInfo` エンドポイントから link:https://openid.net/specs/openid-connect-core-1_0.html#UserInfo[UserInfo] JSON オブジェクトをリクエストします。

source: Set the `quarkus.redis.tls.enabled=true` property
ja_jp: `quarkus.redis.tls.enabled=true` プロパティを設定

source: Set the `quarkus.redis.tls.enabled=true` property or use the xref:./tls-registry-reference.adoc[TLS registry] (recommended)
ja_jp: `quarkus.redis.tls.enabled=true` プロパティーを設定するか、xref:./tls-registry-reference.adoc[TLS レジストリー] を使用します (推奨)。

source: Set the codec to use to receive the message
ja_jp: メッセージの受信に使用するコーデックを設定します。

source: Set the configuration and write the test code the same way as it is described in the <<code-flow-integration-testing-wiremock,Wiremock>> section.
ja_jp: <<code-flow-integration-testing-wiremock,Wiremock>> セクションで説明されているのと同様に、設定を行いテストコードを記述します。

source: Set the data used in the template.
ja_jp: テンプレートで使用するデータを設定します。

source: Set the data, i.e. the value of the `data` field of a SSE message.
ja_jp: データ、つまり SSE メッセージの `data` フィールドの値を設定します。

source: Set the database version. The Hibernate ORM dialect will target that version.
ja_jp: データベースのバージョンを設定します。Hibernate ORM dialectはそのバージョンをターゲットにします。

source: Set the database version. The Hibernate ORM dialect will target that version. Since we're targeting CockroachDB here, we're passing the CockroachDB version, not the PostgreSQL version.
ja_jp: データベースのバージョンを設定します。Hibernate ORM dialectはそのバージョンをターゲットにします。 ここではCockroachDBをターゲットにしているので、PostgreSQLのバージョンではなく、CockroachDBのバージョンを渡しています。

source: Set the default scope to `@ApplicationScoped` - can be any CDI scope of your preference
ja_jp: デフォルトのスコープを `@ApplicationScoped` に設定 - 任意のCDIスコープにすることも可能

source: Set the event name, i.e. the value of the `event` field of a SSE message.
ja_jp: イベント名、つまり SSE メッセージの `event` フィールドの値を設定します。

source: Set the execution model for callback handlers. By default, the callback may block the current thread. However in this case, the callback is executed on the event loop and may not block the current thread.
ja_jp: コールバックハンドラーの実行モデルを設定します。デフォルトでは、コールバックは現在のスレッドをブロックする可能性があります。ただし、この場合、コールバックはイベントループで実行され、現在のスレッドをブロックしない可能性があります。

source: Set the explicit bucket boundaries for the histogram. The boundaries are inclusive.
ja_jp: ヒストグラムの明示的なバケット境界を設定します。 これは、境界値も含みます。

source: Set the exporter to `logging`. Normally you don't need to set this. The default is `cdi`.
ja_jp: エクスポーターを `logging` に設定します。 通常、これを設定する必要はありません。 デフォルトは `cdi` です。

source: Set the interval to export the metrics. The default is `1m`, which is too long for debugging.
ja_jp: メトリクスのエクスポート間隔を設定します。デフォルトは `1m` ですが、デバッグには長すぎます。

source: Set the metrics exporter to `logging`. Normally you don't need to set this. The default is `cdi`.
ja_jp: メトリクスエクスポーターを `logging` に設定します。通常、これを設定する必要はありません。デフォルトは `cdi` です。

source: Set the minimum log level globally with the `quarkus.log.min-level` configuration property, or set it per category:
ja_jp: `quarkus.log.min-level` 設定プロパティーを使用して最小ログレベルをグローバルに設定するか、カテゴリーごとに設定します。

source: Set the minimum required header information as outlined in the following example:
ja_jp: 以下の例のように、最低限必要なヘッダー情報を設定します：

source: Set the minimum required header information to ensure that the content renders correctly in the website portal and on the documentation home page, as outlined in the following example:
ja_jp: 次の例に示すように、Web サイトポータルとドキュメントのホームページでコンテンツが正しく表示されるように、最低限必要なヘッダー情報を設定します。

source: Set the name of the codec to use to send the message
ja_jp: メッセージの送信に使用するコーデックの名前を設定します。

source: Set the number of characters of a text message payload which will be logged.
ja_jp: ログに記録されるテキストメッセージペイロードの文字数を設定します。

source: Set the oldest acceptable stream value per platform. Streams older than the configured values will be ignored by the client.
ja_jp: プラットフォームごとに許容される最も古いストリーム値を設定します。設定された値よりも古いストリームはクライアントによって無視されます。

source: Set the parameters needed by the RPC method, `name` and `configKey`.
ja_jp: RPC メソッドが必要とするパラメーター (`name` と `configKey`) を設定します。

source: Set the path param value. Throws `IllegalArgumentException` if the client endpoint path does not contain a parameter with the given name.
ja_jp: パスパラメーター値を設定します。クライアントエンドポイントパスに指定された名前のパラメーターが含まれていない場合は、 `IllegalArgumentException` がスローされます。

source: Set the path to the headless component JavaScript file (relative to the extension resources).
ja_jp: ヘッドレスコンポーネントの JavaScript ファイルへのパスを設定します (エクステンションリソースからの相対パス)。

source: Set the property in the Maven Surefire plugin configuration.
ja_jp: Maven Surefire プラグインの設定でプロパティーを設定します。

source: Set the property in the `build.gradle` file.
ja_jp: `build.gradle` ファイルでプロパティーを設定します。

source: Set the property to ...
ja_jp: プロパティーを以下に設定する

source: Set the stage, why Quarkus is relevant
ja_jp: ステージ設定、なぜQuarkusが必要なのか

source: Set the storage engine for the MariaDB dialect of the `offline` persistence unit.
ja_jp: `offline` 永続化ユニットの MariaDB ダイアレクト用のストレージエンジンを設定します。

source: Set the tenant-specific cookie paths which makes sure the session cookie is only visible to the tenant which created it.
ja_jp: テナント固有の Cookie パスを設定し、セッション Cookie がそれを作成したテナントにのみ表示されるようにします。

source: Set the termination time
ja_jp: 終了時刻の設定
